{
  "upgradeSteps": [
    {
      "id": "step-aa",
      "title": "ติดตั้งและปรับแต่ง NetIQ (AA)",
      "description": "ดำเนินการติดตั้งและปรับแต่ง NetIQ Advanced Authentication เพื่อรองรับการยืนยันตัวตนแบบ MFA และ Adaptive Authentication",
      "version": "AA",
      "startDate": "2025-05-01",
      "endDate": "2025-05-20",
      "status": "Completed",
      "assignee": "Busisoft",
      "order": 0
    },
    {
      "id": "step-1",
      "title": "Clone ระบบ NAM ทั้งหมด",
      "description": "สร้างสำเนาของระบบ NAM ปัจจุบัน (v4.5.3) ไปยังสภาพแวดล้อมทดสอบที่แยกออกมา เพื่อให้เราอัปเกรดและทดสอบได้อย่างปลอดภัย ไม่กระทบการทำงานปกติ",
      "version": "v4.5.3",
      "startDate": "2025-06-10",
      "endDate": "2025-06-30",
      "status": "In Progress",
      "assignee": "THP",
      "order": 1
    },
    {
      "id": "step-2",
      "title": "อัปเกรด NAM เป็น v4.5.5",
      "description": "อัปเกรด NAM ในระบบแยกเป็น v4.5.5 เพื่อปรับปรุงส่วนประกอบพื้นฐานและแก้ไขปัญหาด้านความปลอดภัยบางประการ",
      "details": [
        "อัปเดต Tomcat 8.5.72, OpenSSL 1.0.2za, Apache 2.4.51",
        "แก้ไขปัญหาความปลอดภัยเกี่ยวกับอักขระพิเศษและ SAML"
      ],
      "version": "v4.5.5",
      "startDate": "2025-07-01",
      "endDate": "2025-07-10",
      "status": "Not Started",
      "assignee": "Busisoft",
      "order": 2
    },
    {
      "id": "step-3",
      "title": "อัปเกรด SUSE Linux เป็น 12 SP5",
      "description": "การอัปเกรดระบบปฏิบัติการ SUSE Linux เป็น 12 SP5 เป็นสิ่งจำเป็นก่อนอัปเกรด NAM ไป v5.x เพื่อให้ระบบเข้ากันได้ดีและทำงานได้ราบรื่น",
      "details": [
        "เป็นข้อกำหนดสำคัญ (Prerequisite) สำหรับ NAM v5.x",
        "ป้องกันปัญหาทางเทคนิคและความเข้ากันได้ของระบบ"
      ],
      "version": "SUSE Linux 12 SP5",
      "startDate": "2025-07-11",
      "endDate": "2025-07-19",
      "status": "Not Started",
      "assignee": "Busisoft",
      "order": 3
    },
    {
      "id": "step-4",
      "title": "อัปเกรด NAM เป็น v5.0.3",
      "description": "อัปเกรด NAM ในระบบแยกเป็น v5.0.3 ซึ่งมาพร้อมคุณสมบัติใหม่และการแก้ไขช่องโหว่ที่สำคัญ",
      "details": [
        "รองรับ Kerberos Privileged Attribute Certificate (PAC)",
        "แก้ไขช่องโหว่ร้ายแรง Log4j และ Multiple XSS (CVE-2022-26325)",
        "อัปเดต Tomcat 9.0.65, Apache 2.4.54"
      ],
      "version": "v5.0.3",
      "startDate": "2025-07-20",
      "endDate": "2025-07-31",
      "status": "Not Started",
      "assignee": "Busisoft",
      "order": 4
    },
    {
      "id": "step-5",
      "title": "อัปเกรด NAM เป็น v5.1",
      "description": "อัปเกรดสู่เวอร์ชันเป้าหมาย v5.1 ที่มีการปรับปรุงครั้งใหญ่ด้านการจัดการและความปลอดภัย",
      "details": [
        "หน้าจอจัดการใหม่ (Enhanced Administration Console) บน Angular UI",
        "ปรับปรุง REST APIs สำหรับการทำงานอัตโนมัติ",
        "แก้ไขช่องโหว่ Directory traversal, User impersonation และ Multiple XSS"
      ],
      "version": "v5.1",
      "startDate": "2025-08-01",
      "endDate": "2025-08-10",
      "status": "Not Started",
      "assignee": "Busisoft",
      "order": 5
    },
    {
      "id": "step-6",
      "title": "ตรวจสอบและทดสอบระบบ",
      "description": "ตรวจสอบและทดสอบระบบ NAM ที่อัปเกรดแล้วอย่างละเอียดในระบบแยก เพื่อให้แน่ใจว่าทุกอย่างทำงานถูกต้องและเสถียร ก่อนที่จะนำไปใช้งานจริง",
      "version": "v5.1",
      "startDate": "2025-08-11",
      "endDate": "2025-08-20",
      "status": "Not Started",
      "assignee": "Busisoft",
      "order": 6
    }
  ],
  "versionDetailsData": [
    {
      "id": "aa",
      "name": "NetIQ Advanced Authentication (AA)",
      "summary": "NetIQ Advanced Authentication (AA) ได้รับการติดตั้งและปรับแต่งเพื่อเพิ่มความสามารถในการยืนยันตัวตนขั้นสูง",
      "details": [
        "รองรับ Multi-Factor Authentication (MFA) หลากหลายรูปแบบ เช่น รหัสผ่านครั้งเดียว (OTP), Biometrics (ลายนิ้วมือ, ใบหน้า), Push Notifications",
        "เพิ่ม Adaptive Authentication Policy: สามารถกำหนดนโยบายความปลอดภัยที่ปรับเปลี่ยนได้ตามบริบทการเข้าถึง (เช่น ตำแหน่งที่ตั้ง, อุปกรณ์ที่ใช้, พฤติกรรมการเข้าสู่ระบบ) เพื่อเพิ่มความปลอดภัยโดยไม่กระทบประสบการณ์ผู้ใช้มากเกินไป",
        "ลดความเสี่ยงจากการเข้าถึงโดยไม่ได้รับอนุญาต: ด้วยการยืนยันตัวตนที่แข็งแกร่งขึ้น ช่วยป้องกันการโจมตีแบบ Phishing, Credential Stuffing และ Brute-force Attacks",
        "ปรับปรุงประสบการณ์ผู้ใช้: ด้วยการรวมวิธีการยืนยันตัวตนที่หลากหลายและยืดหยุ่น ทำให้ผู้ใช้สามารถเข้าถึงระบบได้อย่างปลอดภัยและสะดวกสบายยิ่งขึ้น",
        "รองรับมาตรฐานความปลอดภัยล่าสุด: ช่วยให้องค์กรปฏิบัติตามข้อกำหนดด้าน Regulatory Compliance และมาตรฐานความปลอดภัยข้อมูลที่เข้มงวดขึ้น"
      ]
    },
    {
      "id": "v4.5.3",
      "name": "NetIQ Access Manager 4.5.3 (เวอร์ชันปัจจุบัน)",
      "summary": "เวอร์ชันปัจจุบันของ NAM ที่กำลังใช้งานอยู่และกำลังจะได้รับการอัปเกรด",
      "details": [
        "ระบบปฏิบัติการ: ทำงานบน SUSE Linux Enterprise Server 12 SP4 ซึ่งใกล้จะหมดอายุการสนับสนุน (End-of-Life) ทำให้มีความเสี่ยงด้านความปลอดภัยและขาดการอัปเดตแพตช์",
        "ส่วนประกอบพื้นฐาน: Apache HTTP Server (เวอร์ชันเก่า), Tomcat Application Server (เวอร์ชันเก่า), OpenSSL (เวอร์ชันเก่า) ซึ่งอาจมีช่องโหว่ที่ทราบแล้วแต่ยังไม่ได้รับการแก้ไข",
        "ช่องโหว่ความปลอดภัย: อาจมีช่องโหว่ด้านความปลอดภัยที่ยังไม่ถูกแก้ไข (Known Vulnerabilities) ที่อาจถูกโจมตีได้ เช่น Cross-Site Scripting (XSS), SQL Injection, หรือการรั่วไหลของข้อมูล",
        "คุณสมบัติ: ขาดคุณสมบัติใหม่ๆ ที่มีในเวอร์ชันที่สูงกว่า เช่น การจัดการคอนโซลที่ทันสมัย, REST APIs ที่มีประสิทธิภาพ และการรองรับโปรโตคอลการยืนยันตัวตนใหม่ๆ",
        "ความซับซ้อนในการจัดการ: การจัดการระบบยังคงใช้หน้าจอแบบเดิมซึ่งอาจไม่เป็นมิตรกับผู้ใช้งานเท่าที่ควร"
      ]
    },
    {
      "id": "v4.5.5",
      "name": "NetIQ Access Manager 4.5.5 (Patch Update)",
      "summary": "การอัปเกรดแพตช์สำหรับ NAM 4.5.x เพื่อปรับปรุงพื้นฐานและแก้ไขช่องโหว่เร่งด่วน",
      "details": [
        "อัปเดตส่วนประกอบ: อัปเดต Tomcat เป็นเวอร์ชัน 8.5.72, OpenSSL เป็นเวอร์ชัน 1.0.2za, และ Apache HTTP Server เป็นเวอร์ชัน 2.4.51 เพื่อแก้ไขช่องโหว่ที่พบในเวอร์ชันเก่า",
        "แก้ไขปัญหาความปลอดภัย: ปรับปรุงการจัดการอักขระพิเศษ (Special Character Handling) เพื่อป้องกันการโจมตีแบบ Injection ที่เกิดจากการป้อนข้อมูลที่ไม่ถูกต้อง",
        "แก้ไขช่องโหว่ SAML: แก้ไขปัญหาที่เกี่ยวข้องกับ Security Assertion Markup Language (SAML) ซึ่งอาจถูกใช้ในการยืนยันตัวตนที่ผิดพลาดหรือการปลอมแปลงข้อมูล (CVEs specific to SAML vulnerabilities if applicable)",
        "ปรับปรุงความเสถียร: เพิ่มความเสถียรและประสิทธิภาพโดยรวมของระบบด้วยการแก้ไขข้อผิดพลาดเล็กๆ น้อยๆ และปรับปรุงประสิทธิภาพการทำงานของ Core Components"
      ]
    },
    {
      "id": "v5.0.3",
      "name": "NetIQ Access Manager 5.0.3 (Major Update)",
      "summary": "การอัปเกรดเวอร์ชันหลักที่มาพร้อมคุณสมบัติใหม่และการแก้ไขช่องโหว่ที่สำคัญ",
      "details": [
        "รองรับ Kerberos Privileged Attribute Certificate (PAC): เพิ่มความสามารถในการจัดการ Kerberos PAC ซึ่งช่วยให้การยืนยันตัวตนและการจัดการสิทธิ์ในสภาพแวดล้อม Active Directory มีประสิทธิภาพและปลอดภัยยิ่งขึ้น",
        "แก้ไขช่องโหว่ Log4j: ปิดช่องโหว่ Apache Log4j ที่ร้ายแรง (CVE-2021-44228, CVE-2021-45046) ซึ่งเป็นช่องโหว่ Zero-day ที่ส่งผลกระทบต่อแอปพลิเคชัน Java จำนวนมากและสามารถนำไปสู่การควบคุมระบบจากระยะไกลได้",
        "แก้ไขช่องโหว่ Multiple XSS: แก้ไขช่องโหว่ Cross-Site Scripting (XSS) หลายจุด (เช่น CVE-2022-26325) ที่อาจถูกใช้ในการโจมตีผู้ใช้งานโดยการฝัง Script ที่เป็นอันตรายลงในหน้าเว็บ",
        "อัปเดตส่วนประกอบ: อัปเดต Tomcat เป็นเวอร์ชัน 9.0.65, Apache เป็นเวอร์ชัน 2.4.54 เพื่อเพิ่มประสิทธิภาพและความปลอดภัยของแพลตฟอร์ม",
        "ปรับปรุงประสิทธิภาพ: มีการปรับปรุงภายในเพื่อเพิ่มประสิทธิภาพการทำงานและลด Latency ในการประมวลผลคำขอ"
      ]
    }, 
    {
      "id": "v5.1",
      "name": "NetIQ Access Manager 5.1 (Target Version)",
      "summary": "เวอร์ชันเป้าหมายที่มีการปรับปรุงครั้งใหญ่ด้านการจัดการ ความปลอดภัย และ REST APIs เพื่อรองรับอนาคต",
      "details": [
        "Enhanced Administration Console (Angular UI): ผู้ดูแลระบบจะได้รับหน้าจอการจัดการใหม่ที่ทันสมัย ใช้งานง่ายขึ้น พัฒนาด้วย Angular UI ซึ่งช่วยเพิ่มประสิทธิภาพในการตั้งค่า, ตรวจสอบ, และแก้ไขปัญหาต่างๆ",
        "ปรับปรุง REST APIs สำหรับ Automation: RESTful APIs ได้รับการปรับปรุงและขยายขีดความสามารถ ทำให้สามารถทำงานร่วมกับระบบอื่นๆ ได้อย่างราบรื่นยิ่งขึ้น และรองรับการทำงานแบบอัตโนมัติ (Automation) สำหรับงานด้านการจัดการผู้ใช้, แอปพลิเคชัน, และนโยบายต่างๆ",
        "แก้ไขช่องโหว่ความปลอดภัยเพิ่มเติม: แก้ไขช่องโหว่สำคัญ เช่น Directory Traversal (การเข้าถึงไฟล์นอกเหนือจากที่กำหนด), User Impersonation (การปลอมแปลงเป็นผู้ใช้รายอื่น), และ XSS (Cross-Site Scripting) เพิ่มเติม เพื่อเสริมความแข็งแกร่งของระบบ",
        "ความสามารถในการบูรณาการที่ดีขึ้น: ช่วยให้สามารถบูรณาการกับระบบ Cloud, Mobile Applications, และ Identity Providers ภายนอกได้อย่างง่ายดาย",
        "รองรับมาตรฐาน OpenID Connect/OAuth 2.0: ยืนยันการรองรับมาตรฐานการยืนยันตัวตนและการอนุญาตล่าสุดเพื่อความเข้ากันได้กับแอปพลิเคชันยุคใหม่",
        "ลด Downtime ในการอัปเกรด: มีการปรับปรุงกระบวนการอัปเกรดให้มีความราบรื่นมากขึ้น ลดเวลาที่ระบบจะต้องหยุดทำงาน"
      ]
    }
  ]
}
